// FileSyncUI Localizable.strings

// The name of the product
"FileSyncUI" = "文件同步";

// Text of "ok" button, used in various dialogs.
"OK" = "好";

// Text of "cancel" button, used in various dialogs.
"CANCEL" = "取消";

// Text of "Next" button, used in various dialogs
"NEXT" = "下一个";

// Text of "Done" button, used in various dialogs
"DONE" = "完成";

// Text of "Continue" button, used in various dialogs
"CONTINUE" = "继续";


// ------------------------
// Exception (error) window

"DESTINATION:" = "目的位置：";	// Destination label - prefixes the destination path of a symlink.
"MODIFIED:"    = "修改时间：";		// Modified label - prefixes the displayed mod date
"NAME:"        = "名称：";			// Name label - prefixes the name of the file
"SIZE:"        = "大小：";			// Size label - prefixes the displayed size of the file
"IDISK"		   = "iDisk";			// Prefixing the path with "iDisk/" when appropriate

// These labels tell the user which side of the mirror the file which caused the error resides on
"THIS_COMPUTER" = "在本电脑上";	// For iDisk
".MAC"          = "在 %@ 上";				// For iDisk
"LOCAL_MHD"     = "在本电脑上";	// For Mobile Home Directories (MHD)
"REMOTE_MHD"    = "在网络上";		// For MHD

// To reveal the errored file in Finder when appropriate
"SHOW IN FINDER" = "在 Finder 中显示";


// ------------------------
// Exception (error) dialog

// The title of the exception dialog.
"IDISK ERROR TITLE" = "iDisk 错误";
"MHD ERROR TITLE"   = "个人同步错误";
"FS ERROR TITLE"    = "文件同步错误";

// Error code. The argument is an integer number, such as -43.
"ERROR%" = "错误代码是 %d。";

// Exception count.
// The first argument is an integer index, the second is the total number of errors. E.g., "iDisk Error 1 of 5"
"IDISK ERROR COUNT%" = "iDisk 错误 %d/%d";
"MHD ERROR COUNT%"   = "个人同步错误 %d/%d";
"FS ERROR COUNT%"    = "文件同步错误 %d/%d";

// Title text of the error. Two variations, only one is used at a time.
// The argument is a filename.
"ERROR DELETING%"      = "删除文件“%@”时出现问题。";
"ERROR SYNCING%"       = "同步文件“%@”时出现了问题。";
"ERROR MOVING%"        = "移动文件“%@”时出现问题。";
"ERROR ACCESSING%"     = "同步文件“%@”时出现了问题。";
"DIR:ERROR DELETING%"  = "删除文件夹“%@”时出现问题。";
"DIR:ERROR SYNCING%"   = "同步文件夹“%@”时出现问题。";
"DIR:ERROR MOVING%"    = "移动文件夹“%@”时出现问题。";
"DIR:ERROR ACCESSING%" = "同步文件夹“%@”时出现问题。";


// ------------------------
// Exception dialog error messages.
// The first string is a short description of the error.
// The second string is additional help text.

// dskFulErr
// The first three strings are variations of the short description: iDisk, mobile home, and general syncing.
"IDISK DSKFULERR"      = "您的 iDisk 几乎已满。iDisk 上没有足够的空间来同步此项目。";
"MHD DSKFULERR"        = "您的个人目录几乎已满。没有足够的可用空间来同步此项目。";
"FS DSKFULERR"         = "您的磁盘几乎已满。没有足够的可用空间来同步此项目。";
"IDISK DSKFULERR HELP" = "您的 iDisk 有一些项目在废纸篓中。要腾出更多空间，请清倒废纸篓。";

// afpAccessDenied
// The first two strings are variations of the short description: deleting, syncing
"AFPACCESSDENIED DELETE"     = "您没有删除此文件的权限。";
"AFPACCESSDENIED SYNC"       = "您没有同步此文件的权限。";
"DIR:AFPACCESSDENIED DELETE" = "您没有删除此文件夹的权限。";
"DIR:AFPACCESSDENIED SYNC"   = "您没有同步此文件夹的权限。";
"AFPACCESSDENIED HELP"       = "您可以在 Finder 的“简介”面板中检查您的权限。";

// kSFFileNameDiffersByCase
// The first three strings are variations of the short description: iDisk, mobile home, general syncing.
"IDISK KSFFILENAMEDIFFERSBYCASE"     = "除了某些字母的大小写以外，此文件的名称与 iDisk 上另一个项目的名称是相同的。";
"MHD KSFFILENAMEDIFFERSBYCASE"       = "除了某些字母的大小写以外，此文件的名称与个人目录中另一个项目的名称是相同的。";
"FS KSFFILENAMEDIFFERSBYCASE"        = "除了某些字母的大小写以外，此文件的名称与磁盘上另一个项目的名称是相同的。";
"DIR:IDISK KSFFILENAMEDIFFERSBYCASE" = "除了某些字母的大小写以外，此文件夹的名称与 iDisk 上另一个项目的名称是相同的。";
"DIR:MHD KSFFILENAMEDIFFERSBYCASE"   = "除了某些字母的大小写以外，此文件夹的名称与个人目录中另一个项目的名称是相同的。";
"DIR:FS KSFFILENAMEDIFFERSBYCASE"    = "除了某些字母的大小写以外，此文件夹的名称与磁盘上另一个项目的名称是相同的。";
"KSFFILENAMEDIFFERSBYCASE HELP"      = "您应该更改此项目的名称，以明显区别其他项目。例如，给名称添加一个数字。";

// fBsyErr
"FSBSYERR"      = "文件正在使用。";
"FSBSYERR HELP" = "某应用程序中可能有打开的文件。请尝试关闭该文件或退出应用程序。";

// fLckdErr
"FLCKDERR"      = "文件被锁定。";
"DIR:FLCKDERR"  = "该文件夹已被锁定。";
"FLCKDERR HELP" = "您可以在 Finder 中使用“简介”面板来将项目解锁。";

"File Not Found"      = "文件找不到。";
"HELP:File Not Found" = "在同步过程中，该文件可能已被移动。请尝试再次同步。";

"File Name Too Long"      = "文件或文件夹名称太长。";
"HELP:File Name Too Long" = "请给此项目重新命名以便名称短些。";

"I/O Error"      = "读取或写入文件时出错。";
"HELP:I/O Error" = "请稍后重试。";

"Destination does not support symlinks"      = "目的位置不支持符号链接。";
"HELP:Destination does not support symlinks" = "请尝试首先压缩文件或文件夹。";

"Object deleted"      = "项目在可以被同步之前已被删除。";
//"HELP:Object deleted" = "";

"Object created"      = "在此项目可以被同步之前，一个新项目已创建在同一个位置。";
//"HELP:Object created" = "";

"Object modified"     = "要进行更新的此项目在可以被同步之前已被另一个应用程序更改。";
//"HELP:Object modified" = "";

"Network error"       = "发生网络错误。";
"HELP:Network error"  = "请检查您的网络连接或稍候重试。";

//"Timeout Error"       = "The server has stopped responding.";

"Unknown error"            = "发生问题。";					// [rdar://5231555]
"HELP:Unknown error"       = "请稍后重试。";
"HELP-IDISK:Unknown error" = "请稍后重试。";
"HELP-PHD:Unknown error"   = "请稍后重试。如果问题继续存在，请联系您的网络管理员。";

"IDISK ALMOST FULL"     = "您的 iDisk 几乎已满。";
"ALMOST FULL TRASH MSG" = "您的 iDisk 上有些文件在“废纸篓”中。要腾出更多的使用空间，请清倒“废纸篓”。\n\n您可以在“系统偏好设置”的 %@ 面板中增加 iDisk 的容量。";
"ALMOST FULL .MAC MSG"  = "您可以在“系统偏好设置”的 %@ 面板中增加 iDisk 的容量。";

"REVERIFICATION"      = "在最近 %@ 次同步的过程中，该文件均更改了。";
"REVERIFICATION HELP" = "某应用程序可能会周期性地修改该文件。请尝试关闭该文件或退出应用程序。";

"TOO_MANY_EAS"      = "目的位置不支持此项目所包含的某些数据。";
"TOO_MANY_EAS HELP" = "请尝试首先压缩文件或文件夹。";

// ---------------------
// offline folder dialog

"OFFLINE FOLDER%"    = "“%@”文件夹仅在您的 iDisk 在线时可用。";
"OFFLINE FOLDER MSG" = "要访问此文件夹，您需要将您的电脑连接到 Internet。";


// Size formats, used in the conflict and exception dialog to show file sizes.
// The argument is the number of bytes, the suffixes are the abbreviations for the standard metric scales: kilobytes, megabytes, etc.
"%BYTES" = "%llu 字节";
"%KB"    = "%.2f KB";
"%MB"    = "%.2f MB";
"%GB"    = "%.2f GB";
"%TB"    = "%.2f TB";
"%PB"    = "%.2f PB";
"%XB"    = "%.2f XB";


// --------------------
// Conflict list window

// Conflict count. Singular and plural. The plural argument is an integer. Used in the conflict *list* window, not the conflict resolution window
"1CONFLICT"  = "1 个冲突";
"%CONFLICTS" = "%d 个冲突";


// -----------------------
// Conflict manager window

"%IS_OUT_OF_SYNC"          = "“%@”在两个位置都被修改。";			// Name of conflicting item.
"%WHERE"                   = "位置：%@";						// Path to parent folder of conflicting item.
"%CONFLICT_COUNT"          = "%d/%d";						// Conflict count (arguments are integers i.e., "1 of 16")
"ROOT"                     = "-root-";							// The name of the root of the sync point, rather than @"/"
"FILE"                     = "文件";
"FOLDER"                   = "文件夹";
"PACKAGE"                  = "软件包";
"SYMLINK"                  = "符号链接";
"IDISK_LOCAL_TITLE"        = "本电脑";
"IDISK_POPUP_LOCAL_TITLE"  = "保留这台电脑上的文件";
"IDISK_POPUP_REMOTE_TITLE" = "将文件保留在 %@ 上";
"MHD_LOCAL_TITLE"          = "在本电脑上";
"MHD_REMOTE_TITLE"         = "在网络上";
"MHD_POPUP_LOCAL_TITLE"    = "保留这台电脑上的文件";
"MHD_POPUP_REMOTE_TITLE"   = "保留网络上的文件";
"1_IDISK_CONFLICT"         = "有 1 个 iDisk 同步冲突。";			// Singular for iDisk
"%_IDISK_CONFLICTS"        = "有 %d 个 iDisk 同步冲突。";			// Plural for iDisk
"1_MHD_CONFLICT"           = "有 1 个个人同步冲突。";				// Singular for MHD
"%_MHD_CONFLICTS"          = "有 %d 个个人同步冲突。";			// Plural for MHD
"IDISK_RESOLVE_REMOTE"     = "通过使用 %@ 上的文件来解决所有冲突";
"IDISK_RESOLVE_LOCAL"      = "通过使用本电脑上的文件来解决所有冲突";
"IDISK_RESOLVE_BOTH"       = "通过保留两个文件来解决所有冲突";
"IDISK_RESOLVE_LASTMOD"    = "通过保留最近修改的文件来解决所有冲突。";
"IDISK_RESOLVE_EXCLUDE"    = "通过从未来同步中排除文件来解决所有冲突。";
"IDISK_RESOLVE_NONE"       = "忽略所有冲突。";
"MHD_RESOLVE_REMOTE"       = "通过使用网络上的文件来解决所有冲突";
"MHD_RESOLVE_LOCAL"        = "通过使用本电脑上的文件来解决所有冲突";
"MHD_RESOLVE_BOTH"         = "通过保留两个文件来解决所有冲突";
"MHD_RESOLVE_LASTMOD"      = "通过保留最近修改的文件来解决所有冲突。";
"MHD_RESOLVE_EXCLUDE"      = "通过从未来同步中排除文件来解决所有冲突。";
"MHD_RESOLVE_NONE"         = "忽略所有冲突。";
"MHD_CONFLICT_TITLE"       = "同步冲突";

// Unable to resolve all conflicts alert sheet
"NOT_ALL_RESOLVED_TITLE" = "无法解决所有冲突";
"NOT_ALL_RESOLVED_MSG"   = "未能解决某些冲突，因为它们的修改日期太接近。请手动或通过使用不同的选项来解决这些冲突。";

"There are no file syncing errors or conflicts." = "没有文件同步错误或冲突。";

// -----------------
// Global Exceptions

// iDisk
"GLOBAL-IDISK:Timeout"      = "您的 iDisk 没有完成同步。请稍后再试一次。";
"GLOBAL-HELP-IDISK:Timeout" = "如果同步 iDisk 时仍然有问题，则您的 Internet 连接可能存在问题。请尝试退出其他使用 Internet 的应用程序，然后再试一次。";

"GLOBAL-IDISK:NetworkError"      = "您的 iDisk 没有完成同步。";
"GLOBAL-HELP-IDISK:NetworkError" = "请检查您的网络连接或稍候重试。";

"GLOBAL-IDISK:RemoteBusy"      = "您的 iDisk 没有完成同步。";
"GLOBAL-HELP-IDISK:RemoteBusy" = "请稍后重试。";

"GLOBAL-IDISK:UNKNOWN"      = "您的 iDisk 没有完成同步，因为发生了问题。";
"GLOBAL-HELP-IDISK:UNKNOWN" = "请稍后重试。";

// PHD
"GLOBAL-PHD:Timeout"      = "您的个人目录没有完成同步。请稍后再试一次。";
"GLOBAL-HELP-PHD:Timeout" = "如果同步个人目录时仍然有问题，则您的网络连接可能存在问题。请尝试退出其他使用网络的应用程序，然后再试一次。";

"GLOBAL-PHD:NetworkError"      = "您的个人目录没有完成同步。";
"GLOBAL-HELP-PHD:NetworkError" = "请检查您的网络连接或稍候重试。";

"GLOBAL-PHD:RemoteBusy"      = "您的个人目录没有完成同步。";
"GLOBAL-HELP-PHD:RemoteBusy" = "请稍后重试。";

"GLOBAL-PHD:UNKNOWN"      = "您的个人目录没有完成同步，因为发生了问题。";
"GLOBAL-HELP-PHD:UNKNOWN" = "请稍后重试。";

// Other
"GLOBAL-FS:Timeout"      = "您的文件没有完成同步。请稍后再试一次。";
"GLOBAL-HELP-FS:Timeout" = "如果同步文件时仍然有问题，则您的网络连接可能存在问题。请尝试退出其他使用网络的应用程序，然后再试一次。";

"GLOBAL-FS:NetworkError"      = "您的文件没有完成同步。";
"GLOBAL-HELP-FS:NetworkError" = "请检查您的网络连接或稍候重试。";

"GLOBAL-FS:RemoteBusy"      = "您的文件没有完成同步。";
"GLOBAL-HELP-FS:RemoteBusy" = "请稍后重试。";

"GLOBAL-FS:UNKNOWN"      = "您的文件没有完成同步，因为发生了问题。";
"GLOBAL-HELP-FS:UNKNOWN" = "请稍后重试。";
